Repository: vyfido/visopsys
Catalog: contrib/doga-turkish/src/programs/*/keymap.po
Languages: tr

source: ERROR: %s
tr: HATA: %s

source: (current)
tr: (mevcut)

source: ASCII codes:
tr: ASCII kodlari:

source: Alt Gr code:
tr: Alt Gr kodu:

source: Backspace
tr: Silme tusu

source: Can't write %s: Filesystem is read-only
tr: %s 'a yazilamiyor: Dosya sistemi sadece-okunabilir(yazma korumali)

source: Cancel
tr: Iptal

source: Change key settings
tr: Tus ayarlarini degistir

source: Choose the output file:
tr: Çikti dosyasi seçin:

source: Close
tr: Kapat

source: Couldn't find keyboard map %s
tr: Klavye haritasi %s bulunamiyor

source: Couldn't get current keyboard map
tr: Mevcut klavye haritasi alinamiyor

source: Couldn't open file %s
tr: %s dosyasi açilamiyor

source: Couldn't read file %s
tr: %s dosyasi okunamiyor

source: Couldn't set keyboard map to %s
tr: Klavye haritasi %s'a ayarlanamiyor

source: Couldn't write file %s
tr: %s dosyasina yazilamiyor

source: Couldn't write keyboard map setting
tr: Klavye haritasi ayarlari yazilamiyor

source: Ctrl code:
tr: Ctrl Kodu:

source: Current:
tr: Mevcut:

source: Error
tr: Hata

source: Keyboard Map
tr: Klavye Haritasi

source: Map saved
tr: Harita kaydedildi

source: Missing filename argument for -s option
tr: -s seçenegi için eksik dosya ismi argümani

source: Missing parameter for %s option
tr: %s seçenegi için eksik parametre

source: Name:
tr: Isim:

source: OK
tr: Tamam

source: Regular code:
tr: Normal Kod:

source: Save
tr: Kaydet

source: Save as
tr: Farkli olarak kaydet

source: Saved
tr: Kaydedildi

source: Set as default
tr: Varsayilan olarak ayarla

source: Shift code:
tr: Shift kodu:

source: Space
tr: Bosluk

source: Unknown option '%c'
tr: Bilinmeyen seçenek '%c'

source: usage:
tr: kullanim:
