Repository: vyfido/visopsys
Catalog: contrib/liss-*/src/programs/*/bootmenu.po
Languages: ru

source: [Cursor up/down to select, 'e' edit, '*' default 'd' delete, Enter to accept, 'Q' to quit]
ru: [Выбор - стрелки вверх/вниз, 'e' - редактировать, '*' - по умолчанию 'd' - удалить, Enter - принять, 'Q' - выход]

source: "%s" [Filesystem: %s]
ru: "%s" [файловая система: %s]

source: Automatically boot default selection after (seconds)
ru: Автоматическая загрузка выбранного элемента через (секунд)

source: Boot Menu Installer
ru: Установщик загрузочного меню

source: Boot menu written.
ru: Загрузочное меню записано

source: Can't get buffer memory
ru: Не могу получить буфер памяти

source: Can't get memory for the logical disk list
ru: Не могу получить память для списка логических дисков

source: Can't get the list of logical disks
ru: Не могу получить список логических дисков

source: Can't get the logical disk list
ru: Не могу получить список логических дисков

source: Can't open %s file
ru: Не могу открыть файл %s

source: Can't read %s file
ru: Не могу прочитать файл %s

source: Can't write MBR %s to %s
ru: Не могу записать MBR %s на %s

source: Can't write boot menu
ru: Не могу записать загрузочное меню

source: Can't write boot menu or MBR
ru: Не могу записать меню или MBR

source: Cancel
ru: Отмена

source: Chain-loadable entries for the boot menu:
ru: Вторично-загружаемые элементы для загрузочного меню:

source: Default
ru: По умолчанию

source: Delete
ru: Удалить

source: Disk %s Label: %s Filesystem: %s Chain-loadable: %s
ru: Диск %s Метка: %s Файловая системя: %s Chain-loadable: %s

source: Disk %s is not a physical hard disk device
ru: Диск %s не физический носитель

source: Done
ru: Готово

source: Edit
ru: Правка

source: Edit entry label
ru: Редактировать метку элемента

source: Enter new label (%d characters max.): [%s] [
ru: Введите новую метку (макс. символов %d): [%s] [

source: Error
ru: Ошибка

source: OK
ru: ОК

source: Partitions on the disk:
ru: Разделы на диске:

source: Permission Denied
ru: Доступ запрещен

source: no
ru: нет

source: usage: %s <disk name>
ru: использование: %s <имя_диска>

source: yes
ru: да
