Repository: vyfido/visopsys
Catalog: contrib/liss-*/src/programs/*/copy-mbr.po
Languages: ru

source: Add disk signature to new MBR
ru: Добавить сигнатуру диска в новую MBR

source: Copy partition table to new MBR
ru: Копировать таблицу разделов в новую MBR

source: Could only read %d bytes from %s
ru: Возможно только чтение %d байт из %s

source: Error opening file %s
ru: Ошибка открытия файла %s

source: Error reading disk %s
ru: Ошибка чтения диска %s

source: Error reading file %s
ru: Ошибка чтения файла %s

source: Error writing disk %s
ru: Ошибка записи диска %s

source: Read MBR sector from %s
ru: Прочитать сектор MBR из %s

source: Write MBR sector to %s
ru: Записать сектор MBR в %s

source: usage: %s <MBR image> <output device>
ru: использование: %s <образ_MBR> <целевое_устройство>
