Repository: vyfido/visopsys
Catalog: contrib/ap0r-jens-*/src/programs/*/bootmenu.po
Languages: es

source: [Cursor up/down to select, 'e' edit, '*' default 'd' delete, Enter to accept, 'Q' to quit]
es: [Cursor arriba/abajo para seleccionar, 'e' edita, '*' valores por defecto, Enter para aceptar y Esc para salir ]

source: There are no chain-loadable operating systems on this disk.
es: No existen sistemas operativos con arranque por cadena en este disco.

source: "%s" [Filesystem: %s]
es: "%s" [Sistema de archivos: %s]

source: Automatically boot default selection after (seconds)
es: Automaticamente iniciar la seleccion por defecto luego de (segundos)

source: Boot Menu Installer
es: Instalador del menu de arranque

source: Boot menu written.
es: Menu de arranque escrito.

source: Can't get buffer memory
es: No se pudo obtener memoria bufer

source: Can't get disk %s
es: No se pudo acceder al disco %s

source: Can't get memory for the logical disk list
es: No se pudo obtener memoria para la lista de discos logicos

source: Can't get the list of logical disks
es: No se pudo obtener la lista de discos logicos

source: Can't get the logical disk list
es: No se pudo obtener la lista de disco logico

source: Can't open %s file
es: No se puede abrir el archivo %s

source: Can't read %s file
es: No se pudo leer el archivo %s

source: Can't write MBR %s to %s
es: No se pudo escribir MBR %s en %s

source: Can't write boot menu
es: No se pudo escribir el menu de arranque

source: Can't write boot menu or MBR
es: No se puede escribir el menu de arranque o MBR

source: Cancel
es: Cancelar

source: Chain-loadable entries for the boot menu:
es: Entradas de cadenas cargables para el menu de arranque:

source: Default
es: Por defecto

source: Delete
es: Eliminar

source: Disk %s Label: %s Filesystem: %s Chain-loadable: %s
es: Disco %s Nombre: %s Sistema de Archivos: %s Cargable por cadena: %s

source: Disk %s is not a physical hard disk device
es: El disco %s no es un disco duro fisico

source: Done
es: Listo

source: Edit
es: Editar

source: Edit entry label
es: Editar etiqueta inicial

source: Enter new label (%d characters max.): [%s] [
es: Ingrese nueva etiqueta (%d caracteres max.): [%s] [

source: Partitions on the disk:
es: Particiones en el disco:

source: Permission Denied
es: Permiso denegado

source: Visopsys Boot Menu Installer Copyright (C) 1998-2013 J. Andrew McLaughlin
es: Visopsys - Instalador del menu de arranque Copyright (C) 1998-2013 J. Andrew McLaughlin

source: You must be a privileged user to use this command. (Try logging in as user "admin")
es: Usted debe ser un usuario con privilegios administrativos para usar este comando. (Intente iniciar sesion con el usuario "admin")

source: usage: %s <disk name>
es: Uso: %s <Nombre de disco>

source: yes
es: si
