Repository: vyfido/visopsys
Catalog: contrib/ap0r-jens-*/src/programs/*/format.po
Languages: es

source: %s (I)gnore/(U)nmount/(C)ancel?:
es: %s (I)Ignorar/(U)Desmontar/(C)Cancelar?:

source: Press any key to continue.
es: Presione una tecla para continuar.

source: Quitting.
es: Cerrando.

source: Visopsys FORMAT Utility Copyright (C) 1998-2013 J. Andrew McLaughlin
es: Herramienta de FORMATO Visopsys Copyright (C) 1998-2013 J. Andrew McLaughlin

source: YOU HAVE REQUESTED TO FORMAT YOUR ROOT DISK. I probably shouldn't let you do this. After format is complete, you should shut down the computer. Are you SURE you want to proceed?
es: EL DISCO RAÍZ SE FORMATEARÁ. Después del formato debería reiniciar el equipo. Está SEGURO de proceder?

source: %s [-l] [-s] [-t type] [-T] [disk_name]
es: %s [-l] [-s] [-t Tipo] [-T] [Nombre_del_disco]

source: Cancel
es: Cancelar

source: Cancel
es: Cancelar

source: Choose Disk
es: Seleccionar disco

source: Confirmation
es: Confirmación

source: Disk is mounted
es: Disco desmontado

source: Error %d copying boot sector "%s" to disk %s
es: Error %d al copiar sector de arranque "%s" al disco %s

source: Format complete
es: Formato completo

source: Formatting disk %s as %s. All data currenly on the disk will be lost. Are you sure?
es: Formateando disco %s como %s. Todos los datos en el disco se borrarán. Está seguro?

source: Formatting...
es: Formateando...

source: Ignore
es: Ignorar

source: Ignore
es: Ignorar

source: Missing parameter for %s option
es: Parámetro para la opción %s faltante

source: Missing type argument for '-t' option
es: Argumento de tipo para la opción '-t' faltante

source: Missing volume name argument for '-n' option
es: Argumento del nombre de Volúmen para la opción '-n' faltante

source: No boot sector available for filesystem type %s
es: No hay un sector de arranque para el tipo de sistema de archivos %s

source: Success
es: Éxito

source: The disk is mounted as %s. It is STRONGLY recommended that you unmount before continuing
es: Disco montado como %s. Es MUY recomendable desmontarlo antes de continuar

source: Unable to unmount %s
es: No se puede desmontar %s

source: Unknown option '%c'
es: Opción desconocida '%c'

source: Unmount
es: Desmontar

source: Unmount
es: Desmontar

source: Yes
es: Sí

source: You must be a privileged user to use this command. (Try logging in as user "admin")
es: Necesita derechos especiales para usar este comando. (Intente ingresar como "admin")

source: usage:
es: Uso:
