Repository: vyfido/visopsys
Catalog: src/kernel/*/kernel.po
Languages: ru, tr

source: Defragmenting %llu/%llu: %s
ru: Дефрагментация %llu/%llu: %s
tr: %llu/%llu: %s birlestiriliyor

source: Reading filesystem info
ru: Чтение информации о файловой системе
tr: Dosya sistemi bilgisi okunuyor

source: Analyzing
ru: Анализ
tr: Analiz ediliyor

source: %llu files need defragmentation
ru: Фрагментировано %llu файлов
tr: %llu dosyalarinin birlestirilmesi gerekiyor

source: Checking constraints
ru: Проверка ограничений
tr: Kisitlamalar kontrol ediliyor

source: Error getting resizing constraints
ru: Ошибка при определении ограничений размера файловой системы
tr: Kisitlamalar yeniden boyutlandirilirken hata

source: Filesystem cannot resize to %llu blocks (minimum is %llu)
ru: Размер файловой системы не может быть изменен до %llu блоков (минимум - %llu)
tr: Dosya sistemi %llu blok olarak yeniden boyutlandirilamadi (En az %llu)

source: Filesystem cannot resize to %llu blocks (maximum is %llu)
ru: Размер файловой системы не может быть изменен до %llu блоков (максимум - %llu)
tr: Dosya sistemi %llu blok olarak yeniden boyutlandirilamadi (En fazla %llu)

source: Error reading filesystem info
ru: Ошибка при чтении информации о файловой системе
tr: Dosya sistemi bilgisi okunurken hata olustu

source: Error defragmenting filesystem
ru: Ошибка при дефрагментации файловой системы
tr: Dosya sistemi birlestirilirken hata olustu

source: Data exists outside the new size (%u >= %llu)
ru: За пределами нового размера остаются данные (%u >= %llu)
tr: Veri yeni boyutun disinda bulunuyor (%u >= %llu)

source: Error moving data
ru: Ошибка при перемещении данных
tr: Veri tasinirken hata olustu

source: Clearing new FAT sectors
ru: Очистка новых секторов FAT
tr: Yeni FAT sektörleri temizleniyor

source: Error getting memory
ru: Ошибка при получении памяти
tr: Bellege alinirken hata olustu

source: Error clearing new FAT sectors
ru: Ошибка при очистке новых секторов FAT
tr: Yeni FAT sektörleri temizlenirken hata olustu

source: Error synching FAT copies
ru: Ошибка при синхронизации копий FAT
tr: FAT kopyalari senkronize edilirken hata olustu

source: Updating filesystem info
ru: Обновление информации о файловой системе
tr: Dosya sistemi bilgisi güncelleniyor

source: Error updating filesystem info
ru: Ошибка при обновлении информации о файловой системе
tr: Dosya sistemi bilgisi güncellenirken hata olustu

source: Shutting down Visopsys, please wait...
ru: Завершение Visopsys, подождите...
tr: Visopsys kapatiliyor, lütfen bekleyiniz...

source: [ Wait for "OK to power off" message ]
ru: [ Ожидаем разрешения на выключение ]
tr: [ "Simdi kapatabilirsiniz" mesaji için bekleyiniz ]

source: Rebooting.
ru: Перезагрузка.
tr: Yeniden baslatiliyor.

source: OK to power off now.
ru: Теперь питание компьютера можно отключить
tr: Simdi kapatabilirsiniz

source: Shutting down
ru: Выключение
tr: Kapatiliyor

source: SYSTEM HALTED: Panic at %s:%s(%d)
ru: СИСТЕМА ОСТАНОВЛЕНА: Паника в %s:%s(%d)
tr: SISTEM ÇÖKTÜ: Panigin olustugu yer %s:%s(%d)
