Repository: vyfido/visopsys
Catalog: src/programs/*/bootmenu.po
Languages: tr

source: Boot Menu Installer
tr: Boot Menü yukleyicisi

source: Visopsys Boot Menu Installer Copyright (C) 1998-2019 J. Andrew McLaughlin
tr: Visopsys Boot Menü Yükleyici Copyright (C) 1998-2019 J. Andrew McLaughlin

source: You must be a privileged user to use this command. (Try logging in as user "admin")
tr: Bu komutu kullanabilmek için ayricalikli kullanici olmalisiniz. ("admin" kullanicisi olarak giris yapmayi deneyin)

source: Partitions on the disk:
tr: Disk üzerindeki Bölümler:

source: Chain-loadable entries for the boot menu:
tr: Boot menü için zincir-yüklemeli girdiler:

source: Edit
tr: Düzenle

source: Default
tr: Varsayilan

source: Delete
tr: Sil

source: Automatically boot default selection after (seconds)
tr: Otomatik olarak varsayilan seçim boot edilecek (saniye)

source: OK
tr: Tamam

source: Cancel
tr: Iptal

source: Boot menu written.
tr: Boot menüsü yazildi

source: usage: %s <disk name>
tr: Kullanim: %s <disk ismi>

source: Error
tr: Hata

source: Edit entry label
tr: Isim girdisini düzenle

source: Enter new label (%d characters max.): [%s] [
tr: Yeni ismi girin (En fazla %d karakter.): [%s] [

source: Can't get memory for the logical disk list
tr: Mantiksal disk listesi için bellek alinamiyor

source: Disk %s Label: %s Filesystem: %s Chain-loadable: %s
tr: Disk %s Ismi: %s Dosya sistemi: %s zincir-yüklemelilik: %s

source: yes
tr: evet

source: no
tr: hayir

source: Permission Denied
tr: Erisim Reddedildi

source: Can't get the list of logical disks
tr: Mantiksal disklerin listesi alinamiyor

source: "%s" [Filesystem: %s]
tr: "%s" [Dosya sistemi: %s]

source: [Cursor up/down to select, 'e' edit, '*' default 'd' delete, Enter to accept, 'Q' to quit]
tr: [Seçmek için Yukari/asagi tuslarini kullanin, Düzenlemek için "e" , Varsayilan için "*" Silmek için "d", Kabul etmek için "Enter", Çikmak için "q"]

source: Done
tr: Bitti
