Repository: vyfido/visopsys
Catalog: src/programs/*/computer.po
Languages: de, es, tr

source: Browse
de: Durchsuchen
es: Navegar
tr: Seç

source: Mount as...
de: Verbunden als...
es: Montado como...
tr: olarak tak...

source: Unmount
de: Verbindung trennen
es: Desmontar
tr: Çikar

source: Properties
de: Eigenschaften
es: Propiedades
tr: Özellikler

source: Error
de: Fehler
tr: Hata

source: Error re-reading disk info
de: Fehler beim Wiedereinlesen der Disk-Informationen
es: Error al re-leer información de disco
tr: Disk bilgisi yeniden okunurken hata olustu

source: Filesystem on %s is not supported for browsing
de: Das Dateisystem auf %s wird nicht zum Durchsuchen untersützt
es: El sistema de archivos en %s no es soportado para navegar
tr: %s üzerinde dosya sistemi, gezgin tarafindan desteklenmemektedir

source: Can't mount %s on %s
de: %s konnte nicht mit %s verbunden werden
es: No se puede montar %s en %s
tr: %s üzerindeki %s takilamiyor

source: No media in disk %s
de: Keine Dateien auf der Disk %s
es: Sin medios en el disco %s
tr: %s diskinde medya bulunamadi

source: Error launching file browser
de: Fehler beim Start des Datei-Browsers
es: Error al iniciar navegador de archivos
tr: Dosya gezgini açilirken hata olustu

source: Disk is already mounted as %s
de: Disk ist bereits als %s verbunden
es: Disco ya montado como %s
tr: Disk %s olarak zaten takili

source: Mount point
de: Verbindungspunkt
es: Punto de montaje
tr: Takma noktasi

source: Please enter the mount point
de: Bitte geben Sie den Verbindungspunkt ein
es: Por favor, ingrese el punto de montaje
tr: Lütfen takilma noktasini giriniz

source: Disk %s is not mounted
de: Disk %s ist nicht verbunden
es: Disco %s no montado
tr: Disk %s takili degil

source: Error unmounting %s
de: Fehler beim trennen der Verbindung von %s
es: Error al desmontar %s
tr: %s çikartilirken hata olustu

source: Fixed
de: Fixiert
es: Fijado
tr: Onarildi

source: Removable
de: Entfernbar
es: Removible
tr: Çikarilabilir

source: floppy
de: Laufwerk
tr: disket

source: flash disk
de: Festplatte

source: hard disk
de: Festplatte
es: Disco duro
tr: sabit disk

source: %u cylinders, %u heads, %u sectors
de: %u Zylinder, %u Köpfe, %u Sektoren
es: %u cilindros, %u cabezas, %u sectores
tr: %u silindir, %u kafa, %u sektör

source: Size: %llu MB
de: Größe: %llu MB
es: Tamaño: %llu MB
tr: Boyut: %llu MB

source: Partition type: %s
de: Art der Partition: %s
es: Tipo de partición: %s
tr: Bölümlendirme türü: %s

source: Filesystem type: %s
de: Art des Dateisystems: %s
es: Tipo del sistema de archivos: %s
tr: Dosya sistemi türü: %s

source: Mounted as %s%s
de: Verbunden als %s%s
es: Montado como %s%s
tr: %s%s olarak takildi

source: (read only)
de: (Nur Lese-Rechte)
es: (sólo lectura)
tr: (sadece okunabilir)

source: Error spawning browser thread
de: Fehler beim erstellen von Browser-Einträgen
tr: Gezgin islemi olusturulurken hata olustu

source: Error spawning mount as thread
de: Fehler beim erstellen des Eintrags in Bezug auf die Verbindung
tr: Takilma islemi olusturulurken hata olustu

source: Error spawning unmount thread
de: Fehler beim erstellen des Eintrags in Bezug auf die getrennte Verbindung
tr: Çikartma islemi olusturulurken hata olustu

source: Error spawning properties thread
de: Fehler beim erstellen von Einstellungs-Einträgen
tr: Özellikler islemi olusturulurken hata olustu

source: Memory allocation error
de: Fehler bei der Speicheraufteilung
es: Error de memoria
tr: Bellek ayirma hatasi

source: The "%s" command only works in graphics mode
de: Der Befehl "%s" funktioniert nur im Grafik-Modus
es: El comando "%s" funciona solamente en modo gráfico
tr: "%s" komutu sadece grafik modda çalisabilir

source: Can't load icon image %s
de: Das Bild für das Icon kann nicht geladen werden %s
es: No se puede cargar el ícono %s
tr: Ikon dosyasi %s yüklenemedi

source: Computer
es: Computadora
tr: Bilgisayar

source: Disk
es: Disco
