Repository: vyfido/visopsys
Catalog: src/programs/*/confedit.po
Languages: tr

source: Configuration Editor
tr: Konfigurasyon Editörü

source: File
tr: Dosya

source: Save
tr: Kaydet

source: Quit
tr: Çik

source: Add variable
tr: Degisken ekle

source: Change variable
tr: Degiskeni degistir

source: Delete variable
tr: Degiskeni sil

source: Error
tr: Hata

source: Error %d reading configuration file.
tr: %d konfigurasyon dosyasi okunurken hata.

source: Error %d writing configuration file.
tr: %d konfigurasyon dosyasi yazilirken hata.

source: Change Variable
tr: Degiskeni degistir

source: Add Variable
tr: Degisken ekle

source: Variable name:
tr: Degisken adi:

source: value:
tr: deger:

source: OK
tr: Tamam

source: Cancel
tr: Iptal

source: Unsaved changes
tr: Kaydedilmeyen degisiklikler

source: Quit without saving changes?
tr: Degisiklikleri kaydetmeden çikmak istiyor musunuz?

source: The "%s" command only works in graphics mode
tr: "%s" komutu sadece grafik modda çalisabilir

source: Enter filename
tr: Dosya ismi girin

source: Please enter a configuration file to edit:
tr: Lütfen düzenlemek istediginiz konfigurasyon dosyasini girin:

source: Error %d creating new configuration file.
tr: %d yeni konfigurasyon dosyasi olusturulurken hata.
