Repository: vyfido/visopsys
Catalog: src/programs/*/copy-mbr.po
Languages: de

source: usage: %s <MBR image> <output device>
de: Benutzung: %s <MBR image> <ausgangs-gerät>

source: Read MBR sector from %s
de: Lese MBR Sektor von %s

source: Error reading disk %s
de: Fehler beim Lesen de Disk %s

source: Error opening file %s
de: Fehler beim öffnen der Datei %s

source: Error reading file %s
de: Fehler beim Lesen der Datei %s

source: Could only read %d bytes from %s
de: Es können nur %d Bytes von %s gelesen werden

source: Add disk signature to new MBR
de: Füge Disksignatur zur neuen MBR hinzu

source: Copy partition table to new MBR
de: Kopiere Partitionstabelle zur neuen MBR

source: Write MBR sector to %s
de: Schreibe MBR Sektor nach %s

source: Error writing disk %s
de: Fehler beim Schreiben der Disk %s
