Repository: vyfido/visopsys
Catalog: src/programs/*/defrag.po
Languages: es

source: Confirmation
es: Confirmación

source: Press any key to continue.
es: Presione una tecla para continuar.

source: Choose Disk
es: Seleccionar disco

source: Cancel
es: Cancelar

source: The disk is mounted as %s. It is STRONGLY recommended that you unmount before continuing
es: Disco montado como %s. Es MUY recomendable desmontarlo antes de continuar

source: Disk is mounted
es: Disco montado

source: Ignore
es: Ignorar

source: Unmount
es: Montar

source: %s (I)gnore/(U)nmount/(C)ancel?:
es: %s (I) Ignorar/(U) Desmontar/(C) Cancelar?:

source: Unable to unmount %s
es: No se puede desmontar %s

source: Error getting disks info
es: Error al determinar la información del disco

source: Visopsys DEFRAG Utility Copyright (C) 1998-2020 J. Andrew McLaughlin
es: Herramienta de DEFRAGMENTACIÓN Visopsys Copyright (C) 1998-2020 J. Andrew McLaughlin

source: You must be a privileged user to use this command. (Try logging in as user "admin")
es: Necesita derechos especiales para usar este comando. (Intente ingresar como "admin")

source: Unknown filesystem type on disk "%s"
es: Sistema de archivos desconocido en el disco "%s"

source: Error getting info for disk "%s"
es: Error al determinar la información para el disco "%s"

source: Defragmenting the filesystem type "%s" is not supported
es: Defragmentación no soportada para el tipo de sistema de archivos "%s"

source: Defragmenting disk %s. Are you sure?
es: Defragmentando disco %s. Está seguror?

source: Quitting.
es: Cancelando...

source: Defragmenting...
es: Defragmentando...

source: Defragmentation complete
es: Defragmentación completada

source: Success
es: Éxito
