Repository: vyfido/visopsys
Catalog: src/programs/*/format.po
Languages: de

source: Confirmation
de: Bestätigung

source: Yes
de: Ja

source: No
de: Nein

source: Press any key to continue.
de: Drücke eine Taste zum Fortfahren.

source: Error
de: Fehler

source: Choose Disk
de: Disk auswählen

source: Cancel
de: Abbrechen

source: The disk is mounted as %s. It is STRONGLY recommended that you unmount before continuing
de: Die Disk ist als %s verbunden. Es wird SEHR empfohlen die Verbindung erst zu trennen

source: Disk is mounted
de: Disk verbunden

source: Ignore
de: Ignorieren

source: Unmount
de: Verbindung trennen

source: %s (I)gnore/(U)nmount/(C)ancel?:
de: %s (I)Ignorieren/(U)Verbindung trennen/(C)Abbrechen?:

source: Unable to unmount %s
de: Verbindung mit %s kann nicht getrennt werden

source: No boot sector available for filesystem type %s
de: Kein Bootsektor für das %s Dateisystem vorhanden

source: Error %d copying boot sector "%s" to disk %s
de: Fehler %d beim Kopieren des Bootsektors "%s" nach Disk %s

source: usage:
de: Benutzung:

source: %s [-l] [-s] [-t type] [-T] [disk_name]
de: %s [-l] [-s] [-t Typ] [-T] [Disk_name]

source: Missing volume name argument for '-n' option
de: Volumennamen-Argument für '-n' Option fehlt

source: Missing type argument for '-t' option
de: Typen-Argument für '-t' Option fehlt

source: Missing parameter for %s option
de: Parameter für %s Option fehlt

source: Unknown option '%c'
de: Unbekannte Option '%c'

source: Visopsys FORMAT Utility Copyright (C) 1998-2021 J. Andrew McLaughlin
de: Visopsys FORMAT Werkzeug Copyright (C) 1998-2021 J. Andrew McLaughlin

source: You must be a privileged user to use this command. (Try logging in as user "admin")
de: Sie brauchen spezielle Rechte für dieses Kommando. (Versuchen Sie, sich als "admin" einzuloggen)

source: Formatting disk %s as %s. All data currenly on the disk will be lost. Are you sure?
de: Formatiere Disk %s als %s. Alle Daten auf der Disk werden gelöscht. Sind Sie sicher?

source: Quitting.
de: Schliesse.

source: YOU HAVE REQUESTED TO FORMAT YOUR ROOT DISK. I probably shouldn't let you do this. After format is complete, you should shut down the computer. Are you SURE you want to proceed?
de: DIE ROOT DISK WIRD FORMATIERT. Nach der Formatierung sollten Sie den Computer neustarten. Wollen Sie WIRKLICH fortfahren?

source: Formatting...
de: Formatiere...

source: Success
de: Erfolg
