Repository: vyfido/visopsys
Catalog: src/programs/*/ifconfig.po
Languages: tr

source: Network Devices
tr: Ag Aygitlari

source: Enabled at startup
tr: Sistem açilisinda etkin

source: Host name
tr: Saglayici adi

source: Domain name
tr: Alan adi

source: OK
tr: Tamam

source: Cancel
tr: Iptal

source: No supported network devices.
tr: Desteklenen ag aygiti yok.

source: Error
tr: Hata

source: Can't get info for device %s
tr: %s aygiti için bilgi alinamiyor

source: Unknown
tr: Bilinmiyor

source: NOLINK
tr: LINK YOK

source: UP
tr: YUKARI

source: DOWN
tr: ASAGI

source: Networking is %s
tr: Ag %s

source: enabled
tr: etkin

source: disabled
tr: devre disi

source: Disable
tr: Devre disi birak

source: Enable
tr: Etkinlestir

source: Shutting down networking
tr: Ag kapatiliyor

source: Initializing networking
tr: Ag etkinlestiriliyor

source: One moment please...
tr: Bir saniye lütfen...

source: Networking is disabled
tr: Ag devre disi birakildi

source: Can't get the count of network devices
tr: Ag aygitlarinin sayisi alinamiyor
