Repository: vyfido/visopsys
Catalog: src/programs/*/imgboot.po
Languages: de, es, ru

source: Welcome to %s
de: Wilkommen zu %s
es: Bienvenido a %s
ru: Добро пожаловать в %s

source: Would you like to install Visopsys? (Choose continue to skip installing)
de: Wollen Sie Visopsys installieren? (Wählen Sie Fortfahren wenn nicht)
es: Desea instalar Visopsys? (Seleccione Continuar si No)
ru: Установить Visopsys? (Продолжить чтобы пропустить установку)

source: Install
de: Installieren
es: Instalar
ru: Установка

source: Continue
de: Weiter
es: Continuar
ru: Продолжить

source: Don't ask me this again
de: Frage mich nicht wieder
es: No preguntar de nuevo
ru: Не спрашивать про это впредь

source: Would you like to reboot now?
de: Wollen Sie jetzt neu starten?
es: Desea reiniciar el equipo ahora?
ru: Перезагрузить сейчас?

source: Using the administrator account 'admin'. There is no password set.
de: Benutze das 'admin' - Administratorkonto. Kein Passwort konfiguriert.
es: Use la cuenta del administardor 'admin'. Sin contraseña configurada.
ru: Используется уч. запись 'admin'. Пароль не назначен.

source: Error
de: Fehler
ru: Ошибка

source: ERROR: %s
de: FEHLER: %s
ru: ОШИБКА: %s

source: %s Quitting.
de: %s Schliesse.
es: %s Cerrando.
ru: %s Выходим.

source: Reboot?
de: Neu starten?
es: Reiniciar?
ru: Перезагрузить?

source: Reboot
de: Neu starten
es: Reiniciar
ru: Перезагрузка

source: Can't create window!
de: Fenster kann nicht erstellt werden!
es: No se puede crear la ventana!
ru: Не могу создать окно!

source: o Install
de: o Installieren
es: o Instalar
ru: o Установка

source: o Continue
de: o Fortfahren
es: o Continuar
ru: o Продолжить

source: o Always continue (never ask)
de: o Immer fortfahren (nie fragen)
es: o Continuar siempre (no preguntar más)
ru: o Всегда продолжать (не спрашивать)

source: This program can only be run as a privileged user. (Try logging in as user "admin").
de: Dieses Programm kann nur von einem berechtigtem Benutzer ausgeführt werden. (Versuchen Sie, sich als "admin" einzuloggen).
es: Necesita derechos especiales para usar este comando. (Intente ingresar como "admin")

source: Administrator account
de: Administrator Konto
es: Cuenta de administrador
ru: Уч. запись администратора

source: Please select from the following options
de: Bitte wählen Sie eine der folgenden Optionen
es: Por favor, seleccione una de las opciones siguientes
ru: Выберите из следующих опций
