Repository: vyfido/visopsys
Catalog: src/programs/*/install.po
Languages: de, es, ru

source: Install
de: Installieren
es: Instalar
ru: Установка

source: Visopsys Installer Copyright (C) 1998-2021 J. Andrew McLaughlin
de: Visopsys Installierer Copyright (C) 1998-2021 J. Andrew McLaughlin

source: [ Installing on disk %s ]
de: [ Installiere auf Disk %s ]
es: [ Instalando en el disco %s ]
ru: [ Установка на диск %s ]

source: Basic install
de: Basic Installation
es: Instalación básica
ru: Базовая установка

source: Full install
de: Komplette Installation
es: Instalación completa
ru: Полная установка

source: Format %s (erases all data!)
de: Formatiere %s (löscht alle daten!)
es: Formateando %s (borra todos los datos!)
ru: Форматировать %s (все данные будут утеряны!)

source: Choose filesystem type
de: Wähle einen Dateisystem Typ
es: Seleccione un tipo de sistema de archivos
ru: Выберите тип файловой системы

source: Quit
de: Schliessen
es: Cerrar
ru: Выход

source: Please choose a password for the 'admin' account
de: Bitte wähle ein Passwort für den 'admin' Account
es: Seleccione una contraseña para la cuenta de 'admin'
ru: Введите пароль для уч. записи 'admin'

source: Partition disks...
de: Partitioniere Disks...
es: Particionando discos...
ru: Разбивка дисков...

source: Installation cancelled.
de: Installation abgebrochen.
es: Instalación cancelada.
ru: Установка отменена.

source: Press any key to continue.
de: Drücken Sie eine Taste zum Fortfahren.
es: Presione una tecla para continuar.
ru: Нажмите любую клавишу.

source: Error
de: Fehler
ru: Ошибка

source: ERROR: %s
de: FEHLER: %s
ru: ОШИБКА: %s

source: %s Quitting.
de: %s Schliesse.
es: %s Cerrando.
ru: %s Выходим.

source: Complete
de: Komplett
es: Completo
ru: Выполнено

source: Memory allocation error.
de: Fehler bei der Speicherzuweisung.
es: Error de memoria.
ru: Ошибка распределения памятти.

source: Unable to get disk information.
de: Diskinformation kann nicht gelesen werden.
es: Información de disco no disponible.
ru: Невозможно получить информацию о диске.

source: Can't create window!
de: Fenster kann nicht erstellt werden!
es: No se puede crear la ventana!
ru: Не могу создать окно!

source: Confirmation
de: Bestätigung
es: Confirmación
ru: Подтверждение

source: Yes
de: Ja
es: Sí
ru: Да

source: No
de: Nein
ru: Нет

source: Choose Installation Disk
de: Wähle eine Installations Disk
es: Seleccione un disco de instalación
ru: Выберите диск для установки

source: Cancel
de: Abbrechen
es: Cancelar
ru: Отмена

source: Can't open source file "%s"
de: Sourcedatei "%s" kann nicht geöffnet werden
es: El archivo de fuentes "%s" no se puede abrir
ru: Не могу открыть исходный файл "%s"

source: Default
de: Standart
es: Estánder
ru: По умолчанию

source: Choose Filesystem Type
de: Wähle einen Dateisystem Typ
es: Seleccione un tipo de sistema de archivos
ru: Выберите тип файловой системы

source: Supported types:
de: Unterstützte Typen:
es: Tipos soportados:
ru: Поддерживаемые типы:

source: Choose the filesystem type:
de: Wähle den Dateisystem Typ:
es: Seleccione el tipo de sistema de archivos:
ru: Выберите тип ФС:

source: The disk is mounted as %s. It must be unmounted before continuing. Unmount?
de: Die Disk ist als %s verbunden. Verbindung muss vor dem Fortfahren getrennt werden. Verbindung trennen?
es: El disco se montó como %s. La conección debe cortarse antes de continuar. Cortar conección?
ru: Диск подключен как %s. Он должен быть отключен перед тем как продолжить. Отключить?

source: Unable to unmount %s
de: Verbindung mit %s kann nicht getrennt werden
es: El disco %s no se puede desmontar
ru: Невозможно отключить %s

source: Copying boot sector...
de: Kopiere Bootsektor...
es: Copiando sector de arranque...
ru: Копирование загрузочного сектора...

source: Unable to determine the filesystem type on disk "%s"
de: Unbekannter Dateisystemtyp auf Disk "%s"
es: No se puede determinar el tipo de sistema de ficheros en el disco "%s"
ru: Невозможно определить тип ФС на диске "%s"

source: Can't install a boot sector for filesystem type "%s"
de: Es kann kein Bootsektor für den Dateisystemtyp "%s" installiert werden
es: No se puede instalar un sector de arranque el el tipo de sistema de archivos "%s"
ru: Не могу установить загрузочный сектор для ФС "%s"

source: Unable to find the boot sector file "%s"
de: Die Bootsektordatei "%s" kann nicht gefunden werden
es: El archivo del sector de arranque "%s" no se pudo encontar
ru: Невозможно найти файл загрузочного сектора "%s"

source: Error %d copying boot sector "%s" to disk %s
de: Fehler %d beim Kopieren des Bootsektors"%s" zur Disk %s
es: Error %d al copiar el sector de arranque"%s" al disco %s
ru: Ошибка %d копирования загрузочного сектора "%s" to disk %s

source: Done
de: Fertig
es: Listo
ru: Готово

source: Can't open install file "%s"
de: Installionsdatei "%s" kann nicht geöffnet werden
es: No se puede abrir el archivo de instalación "%s"
ru: Не могу открыть файл установки "%s"

source: Copying %s files...
de: Kopiere %s Dateien...
es: Copiando%s archivos...
ru: Копирование %s файлов...

source: Missing file "%s"
de: Datei "%s" fehlt
es: Archivo "%s" faltante
ru: Не найден файл "%s"

source: Set Administrator Password
de: Konfiguriere Administrator-Passwort
es: Configurar contraseña del administrador
ru: Назначить пароль администратор

source: New password:
de: Neues Passwort:
es: Nueva contraseña:
ru: Новый пароль:

source: Confirm password:
de: Passwortwiederholung:
es: Confirmar contraseña:
ru: Подтвердите пароль:

source: Passwords do not match
de: Passwörter unterschiedlich
es: Contraseñas desiguales
ru: Пароли не совпадают

source: No password set. It will be blank.
de: Kein Passwort gewählt. Ohne Passwort.
es: Ninguna contraseña seleccionada. Sin contraseña.
ru: Пароль не назначен. Он будет пустым.

source: New password:
de: Neues Passwort:
es: Nueva contraseña:
ru: Новый пароль:

source: Confirm password:
de: Passwortwiederholung:
es: Confirmar contraseña:
ru: Подтвердите пароль:

source: Unable to create the password file
de: Passwortdatei kann nicht erstellt werden
es: No se puede crear el archivo de contraseñas
ru: Невозможно создать файл паролей

source: Unable to set the "admin" password
de: "admin" Password kann nicht konfiguriert werden
es: La contraseña de "admin" no se puede configurar
ru: Невозможно назначить пароль для "admin"

source: You must be a privileged user to use this command. (Try logging in as user "admin").
de: Sie brauchen spezielle Rechte für dieses Kommando. (Versuchen Sie, sich als "admin" einzuloggen)
es: Necesita derechos especiales para usar este comando. (Intente ingresar como "admin")

source: Can't determine the root disk.
de: Root Disk wurde nicht erkannt.
es: No se puede determinar el disco raíz.
ru: Не могу определить корневой диск.

source: Disk %s is too small (%dK) to install Visopsys (%dK required)
de: Disk %s ist zu klein (%dK) zum Installieren von Visopsys (%dK werden benötigt)
es: Disco %s demasiado pequeño (%dK) para instalar Visopsys (%dK son necesarios)
ru: Диск %s слишком мал (%dK) для установки Visopsys (%dK необходимо)

source: Please choose the install type:
de: Bitte wähle den Installationtyp:
es: Seleccione el tipo de instalación:
ru: Выберите тип установки:

source: Full
de: Komplett
es: Completo
ru: Полная

source: Installing on disk %s. Are you SURE?
de: Installiere auf Disk %s. Sind Sie SICHER?
es: Instalando en el disco %s. Está SEGURO?
ru: Устанавливаем на диск %s. Уверены?

source: Formatting...
de: Formatiere...
es: Formateando...
ru: Форматирование...

source: Formatting...
de: Formatiere...
es: Formateando...
ru: Форматирование...

source: Formatting...
de: Formatiere...

source: Errors during format.
de: Fehler beim Formatieren.
es: Errores al formatear.
ru: Ошибки в процессе форматирования.

source: Error rescanning disk after format.
de: Fehler beim Rescannen der Disk nach Formatierung.
es: Errores al re-escanear el disco después de formatear.
ru: Ошибка сканирования диска после форматирования.

source: Couldn't copy the boot sector.
de: Bootsektor kann nicht kopiert werden.
es: No se puede copiar el sector de arranque.
ru: Не могу скопировать загрузочный сектор.

source: Mounting target disk...
de: Zieldisk wird verbunden
es: Montando disco de destino
ru: Подключение целевого диска...

source: Unable to mount the target disk.
de: Zieldisk kann nicht verbunden werden
es: No se puede montar el disco de destino.
ru: Невозможно подключить целевой диск.

source: Error rescanning disk after mount.
de: Fehler beim Rescannen der Disk nach Verbindung.
es: Errores al re-escanear el disco después de desmontar.
ru: Ошибка сканирования диска после подключения.

source: Unable to unmount the target disk.
de: Verbindung mit Zieldisk kann nicht getrennt werden.
es: No se puede desmontar el disco de destino.
ru: Невозможно отключить целевой диск.

source: The filesystem on disk %s is too small (%lluK) for the selected Visopsys installation (%uK required).
de: Das Dateisystem auf Disk %s ist zu klein (%lluK) für die ausgewählte Visopsysinstallation (%uK benötigt).
es: El sistema de archivos en el disco %s es demasiado pequeño (%lluK) para el tipo de instalación seleccionado (%uK necesarios).
ru: ФС на диске %s крайне мала (%lluK) для выбранной установки Visopsys (%uK необходимо).

source: There MAY not be enough free space on disk %s (%lluK) for the selected Visopsys installation (%uK required). Continue?
de: Es KANN sein, dass auf der Disk %s (%lluK) nicht genug Speicher für die ausgewählte Visopsysinstallation vorhanden ist (%uK benötigt). Fortfahren?
es: PUEDE ser que en el disco %s (%lluK) no hay suficiente memoria para el tipo de instalación seleccionado (%uK necesarios). Continuar?
ru: Возможная нехватка места на диске %s (%lluK) для выбранной установки Visopsys (%uK необходимо). Продолжить?

source: Installing...
de: Installiere...
es: Instalando...
ru: Устанавливаем...

source: Unmounting target disk...
de: Verbindung mit Zieldisk wird getrennt...
es: Desmontando disco de destino...
ru: Отключение целевого диска...

source: Unable to copy files.
de: Dateien können nicht kopiert werden.
es: No se pueden copiar los archivos.
ru: Невозможно скопировать файлы.

source: Installation successful.
de: Installation erfolgreich.
es: Instalado exitosamente.
ru: Установка успешно завершена.

source: OK
ru: ОК

source: Basic
es: Básico
ru: Базовая

source: Visopsys Installer Copyright (C) 1998-2020 J. Andrew McLaughlin
es: Instalador de Visopsys Copyright (C) 1998-2020 J. Andrew McLaughlin
