Repository: vyfido/visopsys
Catalog: src/programs/*/keymap.po
Languages: de, es

source: Keyboard Map
de: Tastaturbelegung
es: Mapa de teclado

source: Current:
de: Aktuell:
es: Actual:

source: Language:
de: Benutzung:

source: Save
de: Speichern
es: Guardar

source: Set as default
de: Als Standard definieren
es: Predeterminar

source: Close
de: Schließen
es: Cerrar

source: usage:
de: Benutzung:
es: Uso:

source: Error
de: Fehler

source: ERROR: %s
de: Fehler: %s

source: Couldn't open file %s
de: Datei %s kann nicht geöffnet werden
es: El archivo %s no pudo ser abierto

source: Couldn't read file %s
de: Datei %s kann nicht gelesen werden
es: No se pudo leer el archivo %s

source: Couldn't find keyboard map %s
de: Tastaturbelegung %s kann nicht gefunden werden
es: Imposible encontrar el mapa %s

source: Couldn't set keyboard map to %s
de: Tastaturbelegung konnte nicht auf %s umgestellt werden
es: Imposible configurar %s como mapa de teclado

source: Couldn't get current keyboard map
de: Derzeitige Tastaturbelegung kann nicht geladen werden
es: Imposible encontrar el mapa actual

source: Couldn't write keyboard map setting
de: Einstellung der Tastaturbelegung kann nicht geschrieben werden
es: No se pudo escribir la configuracion del mapa de teclado

source: Can't write %s: Filesystem is read-only
de: %s kann nicht geschrieben werden: Das Dateisystem kann nur gelesen werden
es: No se puede escribir %s: Sistema de archivos solo lectura

source: Couldn't write file %s
de: Datei %s kann nicht geschrieben werden
es: No se pudo escribir el archivo %s

source: Save as
de: Speichern unter
es: Guardar como

source: Choose the output file:
de: Wählen Sie die auszugebende Datei:
es: Elija el archivo de salida:

source: Saved
de: Gespeichert
es: Guardado

source: Map saved
de: Tastaturbelegung gespeichert
es: Mapa guardado

source: Change key settings
de: Tastatureinstellungen ändern
es: Cambiar teclado

source: Normal
de: Normaler

source: Shift
de: Umschalten

source: Ctrl
de: STRG

source: Cancel
de: Abbrechen
es: Cancelar

source: Ctrl map
de: Code für STRG

source: AltGr map
de: Code für ALT GR

source: Missing filename argument for -s option
de: Fehlendes Argument beim Dateinamen für die Option -s
es: Falta nombre de archivo para la opcion -s

source: Missing parameter for %s option
de: Fehlender Parameter für die Option %s
es: Falta un parametro para la opcion %s

source: Unknown option '%c'
de: Unbekannte Option '%c'
es: Opcion desconocida '%c'

source: (current)
de: (aktuell)
es: (actual)

source: Name:
es: Nombre:

source: Backspace
es: Retroceso

source: Scan code: %d (0x%02x)
es: Codigo de hardware: %d (0x%02x)

source: ASCII codes:
es: Codigo ASCII:

source: Regular code:
es: Codigo regular:

source: Shift code:
es: Código para Shift:

source: Alt Gr code:
es: Codigo AltGr:

source: Ctrl code:
es: Codigo CTRL:
