Repository: vyfido/visopsys
Catalog: src/programs/*/login.po
Languages: es

source: That login name is too long.
es: Nombre del Login demasiado largo.

source: That password is too long.
es: Contraseña demasiado larga.

source: Login Window
es: Ventana de Login

source: Reboot
es: Reiniciar

source: Shut down
es: Apagar

source: password:
es: Contraseña:

source: Login Failed
es: Login fallado

source: Unable to log in to the Window Manager!
es: Imposible ingresar al gestor de ventanas!

source: Read Only
es: Sólo lectura

source: Couldn't load login shell %s!
es: No se puede cargar el Shell de Login %s!

source: Welcome %s
es: Bienvenido %s
