Repository: vyfido/visopsys
Catalog: src/programs/*/ping.po
Languages: de, es, ru, tr

source: Error
de: Fehler
ru: Ошибка
tr: Hata

source: usage: %s [-T] <address | hostname>
de: Benutzung: %s [-T] <address | hostname>
ru: использование: %s [-T] <адрес | хост>

source: %d bytes from %d.%d.%d.%d: icmp_seq=%d ttl=%d time=%llu ms
de: %d Byte von %d.%d.%d.%d: icmp_seq=%d ttl=%d Zeit=%llu ms
es: %d bytes desde %d.%d.%d.%d: icmp_seq=%d ttl=%d tiempo=%llu ms
ru: %d байт от %d.%d.%d.%d: icmp_seq=%d ttl=%d время=%llu ms
tr: %d Byte, %d.%d.%d.%d tarafindan : icmp_seq=%d ttl=%d süre=%llu ms

source: Stop
de: Stopp
es: Detener
ru: Стоп
tr: Dur

source: Networking is not currently enabled
de: Das Arbeiten im Netzwerk ist derzeit nicht aktiviert
es: La red no está habilitada
ru: Сеть не запущена
tr: Ag su anda etkin degil

source: Enter Address
de: Addresse angeben
es: Direccion
ru: Введите адрес
tr: Adresi girin

source: Enter the network address to ping:
de: Geben Sie die Netzwerkadresse ein an die ein Ping geschickt werden soll:
es: Ingrese la direccion de red:
ru: Введите адрес для пинга:
tr: Pinglenecek ag adresini girin:

source: Error opening network connection
de: Fehler beim öffnen der Netzwerkverbindung
es: Error al abrir conexion de red
ru: Ошибка открытия сетевого соединения
tr: Ag baglantisi açilirken hata olustu

source: Ping %d.%d.%d.%d %d(%d) bytes of data
de: Ping %d.%d.%d.%d %d(%d) Byte an Daten
es: Ping %d.%d.%d.%d %d(%d) bytes de datos
ru: Ping %d.%d.%d.%d %d(%d) байт данных
tr: Ping %d.%d.%d.%d %d(%d) Bayt kadar veri

source: Error setting signal handler
de: Fehler beim setzen des Signal-Handlers
es: Error preparando el señalero
tr: Sinyal isleyicisi ayarlanirken hata olustu

source: Error starting response thread
de: Fehler beim starten des Antwort-Eintrages
es: Error al iniciar hilo de respuesta
tr: Yanit islemi olusturulurken hata olustu

source: Memory allocation error
de: Fehler bei der Speicherverteilung
es: Error al reservar memoria
ru: Ошибка распределения памяти
tr: Bellek ayirma hatasi

source: Error pinging host
de: Fehler beim anpingen des Hosts
es: Error al hacer ping al host
ru: Ошибка пингования хоста
tr: saglayici pinglenirken hata olustu

source: --- %d.%d.%d.%d ping statistics ---
de: --- %d.%d.%d.%d Ping-Statistiken ---
es: --- %d.%d.%d.%d estadisticas de ping ---
tr: --- %d.%d.%d.%d Ping-istatistigi ---

source: %d packets transmitted, %d received, %d%% packet loss, time %llums
de: %d Pakete übertragen, %d empfangen, %d%% verloren, Zeit %llums
es: %d paquetes transmitidos, %d recibidos, %d%% paquetes perdidos, tiempo %llums
ru: %d пакетов отправлено, %d получено, %d%% потеряно, время %llums
tr: %d paket aktarildi, %d alindi, %d%% paket kaybi, süre %llums
