Repository: vyfido/visopsys
Catalog: src/programs/*/progman.po
Languages: tr

source: Program Manager
tr: Program Yönetici

source: Memory blocks:
tr: Bellek bloklari:

source: Used memory:
tr: Kullanilan bellek:

source: Free memory:
tr: Bos bellek:

source: Disk performance:
tr: Disk performansi:

source: Read:
tr: Okuma:

source: Write:
tr: Yazma:

source: K/sec
tr: K/san

source: Show all sub-processes
tr: Tüm alt islemleri göster

source: Run program
tr: Program çalistir

source: Set priority
tr: Önem seviyesini ayarla

source: Kill process
tr: Islemi durdur(KILL)

source: Error
tr: Hata

source: Can't get temporary memory for processes
tr: Islemler için geçici bellek alinamiyor

source: running
tr: çalisiyor

source: ready
tr: hazir

source: waiting
tr: bekleniyor

source: sleeping
tr: uykuda

source: stopped
tr: durdu

source: finished
tr: tamamlandi

source: zombie
tr: zombi

source: unknown
tr: bilinmeyen

source: Enter command
tr: Komut girin

source: Please enter a command to run:
tr: Lütfen çalistirilacak komutu girin:

source: Unable to execute program
tr: Program çalistirilamiyor

source: Please enter the desired priority
tr: Lütfen belirlenen önem seviyesini girin

source: Unable to launch file dialog
tr: Dosya diyalogu baslatilamadi

source: The "%s" command only works in graphics mode
tr: "%s" komutu sadece grafik modda çalisabilir

source: Error getting memory
tr: Bellege alinirken hata
