Repository: vyfido/visopsys
Catalog: src/programs/*/sysdiag.po
Languages: es, tr

source: System Diagnostics
es: Diagnostico de sistema
tr: Sistem Tanilama

source: Disk test
es: Prueba de disco
tr: Disk testi

source: Memory test
es: Prueba de memoria
tr: Bellek testi

source: Read-only
es: Solo lectura
tr: Sadece-okunabilir

source: Read-write
es: Lectoescritura
tr: Okunabilir-yazilabilir

source: Test
es: Prueba

source: Quit
es: Salir
tr: Çik

source: You must be a privileged user to use this command. (Try logging in as user "admin")
es: Debe tener privilegios para usar ese comando. (Inicie sesion con el usuario "admin")
tr: Bu komutu kullanabilmek için ayricalikli kullanici olmaniz gerekiyor. ("admin" kullanicisi olarak oturum açmayi deneyin)

source: Do you want to do a read-only test, or a read-write test? A read-only test is faster and guaranteed to be data-safe, however it is less thorough. A read-write test takes longer and is more thorough, but can potentially cause some data loss if your disk is failing.
es: Quiere realizar una prueba de solo lectura, o lectoescritura? La prueba de lectura es rapida y sin riesgos para la informacion, Una prueba de lectoescritura es mas lenta y mucho mas profunda sin embargo existe el riesgo de que cause perdidas de datos si su disco esta fallando.
tr: sadece-okunabilir test mi yoksa, okuma-yazma testi mi istiyorsunuz? Sadece-okunabilir testi hizli ve veri güvenligi garantidir, yinede tam test degildir. Okuma-yazma testi biraz daha uzun sürer ve tam testtir, ancak potansiyel olarak eger diskte problem varsa, veri kaybi olabilir.

source: Performing %s test on disk %s
es: Realizando prueba %s en el disco %s
tr: %s testi, %s diski üzerinde gerçeklestiriliyor...

source: Performing memory test of %uMB - %uMB in use
es: Prueba de memoria de %uMB - %uMB en uso
tr: Bellek testi gerçeklestiriliyor %uMB - %uMB (kullanimda)

source: Test cancelled
es: Prueba cancelada
tr: Test iptal edildi

source: Test completed
es: Prueba completada
tr: Test tamamlandi

source: Error performing test
es: Error al probar
tr: Test gerçeklestirilirken hata

source: %d errors
es: %d errores
tr: %d hata

source: Press any key to continue%s
es: Presione cualquier tecla para continuar%s
tr: Devam etmek için bir tusa basin%s

source: , or 'q' to quit
es: , o 'q' para salir
tr: , veya çikmak için 'q'

source: Please choose the disk to test:
es: Por favor elija el disco a probar:
tr: Lütfen test etmek istediginiz diski seçin:

source: View results
es: Ver resultados
tr: Sonuçlari göster

source: Do you want to view the results?
es: Desea ver los resultados?
tr: Sonuçlari görmek istiyor musunuz?

source: Test results
es: Resultados
tr: Test sonuçlari

source: Disk read error at sector %llu
es: Error de lectura en sector %llu
tr: Sektör %llu 'da okuma hatasi

source: Disk write error at sector %llu
es: Error de escritura en sector %llu
tr: Sektör %llu 'da yazma hatasi

source: Memory error at %llu
es: Error de memoria en %llu
tr: %llu 'de bellek hatasi

source: read-write
es: lectoescritura
tr: okunabilir-yazilabilir

source: read-only
es: solo lectura
tr: sadece-okunabilir

source: [ Press 'Q' to cancel ]
es: [ Presione 'Q' para cancelar ]
tr: [ Iptal etmek için 'Q' ya basin ]

source: Testing disk sectors %llu/%llu
es: Probando los sectores %llu/%llu
tr: Disk sektörleri test ediliyor %llu/%llu

source: Testing memory MB %llu/%llu
es: Probando memoria %llu/%llu MB
tr: Bellek test ediliyor (MB) %llu/%llu

source: Do you want to do a disk test, or a memory test?
es: Quiere realizar una prueba de memoria o de disco?
tr: Disk testi mi yoksa bellek testi mi yapmak istiyorsunuz?

source: Error
tr: Iptal
